fill(-1) :- !.
fill(X) :- asserta(d(X)),
           X1 is X-1,
           fill(X1).
 
%У тризначному числi, всi цифри якого непаpнi, закpеслили середню цифру. Виявилось, що отpимане двозначне число є дiльником вихiдного числа. Знайдiть всi такi тризначнi числа.
task1(X) :- d(A),
            A > 0,
            d(B),
            d(C),
            X is 100 * A + 10 * B + C, %задаємо 3-значне число.
            1 is A mod 2,
            1 is B mod 2,
            1 is C mod 2, %всі цифри непаpнi.
            0 is (A * 100 + 10 * B + C) mod (A * 10 + C). %є дільником.
 
%Знайдiть чотиризначне число, яке є точним квадратом, у якого двi першi цифри однаковi та двi останнi також однаковi
task2(X) :- d(A),
            A > 2,
            d(B),
            B > 1,
            X is (A * 10 + B) * (A * 10 + B),
            0 is (X // 100) mod 11,
            0 is (X mod 100) mod 11.
 
%Скiльки iснує цiлих чисел вiд 1 до 1998, якi не дiляться на жодне з чисел 6, 10, 15?
task3(X) :- task3(X, 1999, 1, 0),!.
task3(X, 1999, 1999, X).
task3(X, 1999, N, C) :- (N mod 6)  > 0,
                        (N mod 10) > 0,
                        (N mod 15) > 0, 
                         NN is N+1,
                         XX is C+1,
                         task3(X,1999,NN,XX).
task3(X, 1999, N, C) :- NN is N+1, task3(X,1999,NN,C).
 
 
%Знайти найменше натуральне число M, яке має наступну властивiсть: сума квадратiв одинадцяти послiдовних натуральних чисел, починаючи з M, є точним квадратом? 
sq(X,Z) :- Z is X * X.

task4(X) :- t4(X, 1, 506).
t4(X, X, S) :- T1 is sqrt(S), T2 is (truncate(sqrt(S)) + 0.0), T1 = T2,!.
t4(X, Z, S) :- Z1 is Z+1,
             sq(Z, T1),
             sq(Z + 11, T2),
             S1 is (S - T1 + T2),
             t4(X, Z1, S1).
 
%В послiдовностi 1998737... кожна цифра, починаючи з пятої, дорiвнює останнiй цифрi суми чотирьох попеpеднiх цифр. Через скiльки цифр знову зустрiнеться початкова комбiнацiя 1998 (тобто скiльки цифр в перiодi)? 
task5(X):- t5(1,9,9,8,X,0).
t5(1,9,9,8,X,X):- X \= 0,!.
t5(A,B,C,D,X,I):- E is ((A+B+C+D) mod 10),
                  A1 is B,
                  B1 is C,
                  C1 is D,
                  D1 is E,
                  I1 is I+1,
                  t5(A1,B1,C1,D1,X,I1).