% Зв'язок 1-N: позичальник-інвестиція, фонд-інвестиція
% Зв'язки M-N: інвестор-фонд

%Наявність атрибутів:
%i. Складеного (реалізувати структурою) 
% -  "піб" інвестора
%іі. Багатозначного до 4, структурою
% - "телефони" інвестора
%iiі. Багатозначного до N "таблицею";
% - країни позичальника
%iv. Багатозначного до N списком 
% "сектори" фонду.

%Перші атрибути у структурах - первинні ключі

%інвестор(ідент_номер, піб(прізв, ім'я, по_батькові), телефони(номер, номер) або телефони(номер))
інвестор(ор0, піб('Мільтон', 'Джон', null), телефони(0503478915, 0503478915)).
інвестор(ор1, піб('Сергієнко', 'Іван', 'Дмитрович'), телефони(0663578315, 0673448123)).
інвестор(ор2, піб('Дмитренко', 'Петро', 'Максимович'), телефони(0994568212)).

%фонд(ном_фонду, назва, сектори, дата_початку, дата_кінця)
фонд(ф0, 'Європейське майбутнє', ['металургія', 'енергетика'], 2000000, date(2019,2,1), date(2022,2,1)).
фонд(ф6, 'Європейське майбутнє 2', ['металургія', 'енергетика'], 2000000, date(2018,12,1), date(2023,12,1)).
фонд(ф1, 'Східне партнерство', ['металургія', 'енергетика', 'харчова', 'машинобудування'], 2000000, date(2017,1,1), date(2022,1,1)).
фонд(ф2, 'Фонд розвитку', ['вугілля', 'нафта', 'машинобудування'], 2000000, date(2016,1,1), date(2026,1,1)).
фонд(ф3, 'Добробут', ['харчова', 'сільське господарство'], 2000000, date(2018,1,1), date(2022,1,1)).
фонд(ф4, 'Стабільність', ['фінанси', 'техно'], 2000000, date(2020,9,1), date(2022,9,1)).
фонд(ф5, 'Західне партнерство', ['металургія', 'машинобудування'], 2000000, date(2015,1,1), date(2025,1,1)).

%інвестиція(#ном_інвестиції, ном_фонду, ном_позичальника, сума)
інвестиція(і0, ф1, п6, 800000).
інвестиція(і1, ф2, п3, 550000).
інвестиція(і2, ф0, п2, 2000000).
інвестиція(і2, ф6, п1, 1100000).
інвестиція(і3, ф2, п5, 400000).
інвестиція(і4, ф5, п4, 500000).

%позичальник(#ном_позичальника,  сектор, борг, дохід)
позичальник(п0, 'енергетика', 0, 400000).
позичальник(п1, 'енергетика', 450000, 2000000).
позичальник(п2, 'енергетика', 50000, 3000000).
позичальник(п3, 'вугілля', 1000000, 4900000).
позичальник(п4, 'металургія', 900000, 5500000).
позичальник(п5, 'машинобудування', 900000, 400000).
позичальник(п6, 'харчова', 60000, 6000000).

%країни(ном_позичальника, країна)
країни(п0, 'Україна').
країни(п0, 'Польща').
країни(п0, 'Німечинна').
країни(п1, 'Польща').
країни(п1, 'Україна').
країни(п2, 'Польща').
країни(п2, 'Греція').
країни(п3, 'Україна').

%зв'язок між інвестором та фондом, many to many: фонд_інвестор(ном_фонду, ідент_номер)'
фонд_інвестор(ф0, ор2).
фонд_інвестор(ф0, ор1).
фонд_інвестор(ф1, ор0).
фонд_інвестор(ф2, ор1).
фонд_інвестор(ф3, ор0).
фонд_інвестор(ф4, ор2).
фонд_інвестор(ф5, ор1).

% _______________________________________________________________________________________
% ЗАПИТИ
% _______________________________________________________________________________________
% Завдання B.



%write here


%_______________________________________________________________________________________
% Завдання C.
% сумування даних
% середній_дохід_в_секторі(?Сектор, ?Середній_дохід) 
% -Сектор -Середній_дохід - середня ціна по всіх секторах
% +Сектор -Середній_дохід - середній дохід в секторі
% +Сектор +Середній_дохід - чи правда, що середній дохід в секторі Сектор дорівнює Середній_дохід

 середній_дохід_в_секторі(Сектор, Середній_дохід) :-
     findall(Дохід, позичальник(_, Сектор, _, Дохід), Список),
     average(Список, Середній_дохід).

%?- середній_дохід_в_секторі(Сектор, Дохід).
%Дохід = 3171428.5714285714.
%?- середній_дохід_в_секторі('енергетика', Дохід).
%Дохід = 1800000.
%?- середній_дохід_в_секторі('енергетика', 1800000).
%true.


%_______________________________________________________________________________________
% Завдання D.

% "ті(принаймні один)" 
%  фонди, що мають принаймі один спільний сектор з фондом Х
%  принаймі_один_сектор(Назва1, Назва2) :-
% +Фонд1, -Фонд2  - фонди, у яких є принаймі один спільний сектор з Фонд1
% -Фонд1, +Фонд2  - фонди, у яких є принаймі один спільний сектор з Фонд2
% +Фонд1, +Фонд2  - чи істина, що у Фонд1 та Фонд2 є принаймі один спільний сектор 
% -Фонд1, -Фонд2  - пари таких фондів, у яких є спільні сектори для інвестування
принаймі_один_сектор(Назва1, Назва2) :-
 фонд(_, Назва1, Сектори1, _, _, _),
 фонд(_, Назва2, Сектори2, _, _, _),
 Назва1 \= Назва2,
 intersect(Сектори1, Сектори2).

% ?- принаймі_один_сектор('Західне партнерство', Фонд).
% Фонд = 'Європейське майбутнє' ;
% Фонд = 'Європейське майбутнє 2' ;
% Фонд = 'Східне партнерство' ;
% Фонд = 'Фонд розвитку' ;
% false.

% ?- принаймі_один_сектор('Західне партнерство', 'Фонд розвитку').
% true.

% ?- принаймі_один_сектор('Західне партнерство', 'Добробут').
% false.

% ?- принаймі_один_сектор(Фонд1, Фонд2).
%Фонд1 = 'Європейське майбутнє',
%Фонд2 = 'Європейське майбутнє 2' ;
%Фонд1 = 'Європейське майбутнє',
%Фонд2 = 'Східне партнерство' ;
%Фонд1 = 'Європейське майбутнє',
%Фонд2 = 'Західне партнерство' ;
%Фонд1 = 'Європейське майбутнє 2',
%Фонд2 = 'Європейське майбутнє' ;
%Фонд1 = 'Європейське майбутнє 2',
%Фонд2 = 'Східне партнерство' ;
%Фонд1 = 'Європейське майбутнє 2',
%Фонд2 = 'Західне партнерство' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Європейське майбутнє' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Європейське майбутнє 2' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Фонд розвитку' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Добробут' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Західне партнерство' ;
%Фонд1 = 'Фонд розвитку',
%Фонд2 = 'Східне партнерство' ;
%Фонд1 = 'Фонд розвитку',
%Фонд2 = 'Західне партнерство' ;

%_______________________________________________________________________________________

% "тільки ті"
% фонди, що мають тільки такі дзволені країни, які є у фонду Х
% 3) тільки_ті_сектори(Фонд1, Фонд2)
% +Фонд1, -Фонд2  - фонди, які інвестують тільки у ті сектори, що й Фонд1
% -Фонд1, +Фонд2  - фонди, які інвестують тільки у ті сектори, що й Фонд2
% +Фонд1, +Фонд2  - чи істина, що Фонд1 інвестує тільки у ті сектори, що й Фонд2
% -Фонд1, -Фонд2  - пари таких фондів, що Фонд1 інвестує тільки у ті сектори, що й Фонд2

тільки_ті_сектори(Назва1, Назва2) :-
 фонд(_, Назва1, Сектори1, _, _, _),
 фонд(_, Назва2, Сектори2, _, _, _),
 Назва1 \= Назва2,
 subset(Сектори2, Сектори1).

%?- тільки_ті_сектори(Фонд1, Фонд2).
%Фонд1 = 'Європейське майбутнє',
%Фонд2 = 'Європейське майбутнє 2' ;
%Фонд1 = 'Європейське майбутнє 2',
%Фонд2 = 'Європейське майбутнє' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Європейське майбутнє' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Європейське майбутнє 2' ;
%Фонд1 = 'Східне партнерство',
%Фонд2 = 'Західне партнерство' ;
%false.

% ?- тільки_ті_сектори('Західне партнерство', Фонд ).
% false.

% ?- тільки_ті_сектори(Фонд, 'Західне партнерство').
% Фонд = 'Східне партнерство' ;
% false.

% ?- тільки_ті_сектори('Східне партнерство', 'Західне партнерство').
% true.

%_______________________________________________________________________________________
% "усі ті" -
% фонди, що мають тільки такі дзволені країни, які є у фонду Х
% тільки_ті_сектори(Фонд1, Фонд2)
% +Фонд1, -Фонд2  - фонди, які інвестують в усі ті сектори, що й Фонд1
% -Фонд1, +Фонд2  - фонди, які інвестують в усі ті сектори, що й Фонд2
% +Фонд1, +Фонд2  - чи істина, що Фонд1 інвестує в усі ті сектори, що й Фонд2
% -Фонд1, -Фонд2  - пари таких фондів, що Фонд1 інвестує в усі ті сектори, що й Фонд2

в_усі_сектори(Назва1, Назва2) :- 
 фонд(_, Назва1, Сектори1, _, _, _),
 фонд(_, Назва2, Сектори2, _, _, _),
 Назва1 \= Назва2,
 subset(Сектори1, Сектори2).



% обернене до попереднього запиту
%?- в_усі_сектори(Фонд1, Фонд2).
%Фонд1 = 'Європейське майбутнє',
%Фонд2 = 'Європейське майбутнє 2' ;
%Фонд1 = 'Європейське майбутнє',
%Фонд2 = 'Східне партнерство' ;
%Фонд1 = 'Європейське майбутнє 2',
%Фонд2 = 'Європейське майбутнє' ;
%Фонд1 = 'Європейське майбутнє 2',
%Фонд2 = 'Східне партнерство' ;
%Фонд1 = 'Західне партнерство',
%Фонд2 = 'Східне партнерство' ;
%false.

% ?- в_усі_сектори('Східне партнерство', 'Західне партнерство').
% false.

% ?- в_усі_сектори('Західне партнерство', 'Східне партнерство').
% true.

% ?- в_усі_сектори('Західне партнерство', Фонд).
% Фонд = 'Східне партнерство' ;
% false.

% ?- в_усі_сектори(Фонд, 'Європейське майбутнє').
% Фонд = 'Європейське майбутнє 2' ;
% false.
%_______________________________________________________________________________________
% "усі ті та тільки ті" -
% фонди, які інвестують у ті й тільки ті сектори, що й фонд Х
% ті_та_тільки_ті_сектори(Назва1, Назва2)
% +Фонд1, -Фонд2  - фонди, які інвестують в усі та тільки ті сектори, що й Фонд1
% -Фонд1, +Фонд2  - фонди, які інвестують в усі та тільки ті сектори, що й Фонд2
% +Фонд1, +Фонд2  - чи істина, що Фонд1 інвестує в усі та тільки ті сектори, що й Фонд2
% -Фонд1, -Фонд2  - пари таких фондів, що Фонд1 інвестує в усі ті сектори, що й Фонд2

ті_та_тільки_ті_сектори(Назва1, Назва2) :- 
 в_усі_сектори(Назва1, Назва2),
 тільки_ті_сектори(Назва1, Назва2).

% ?- ті_та_тільки_ті_сектори(Фонд1, Фонд2).
% Фонд1 = 'Європейське майбутнє',
% Фонд2 = 'Європейське майбутнє 2' ;
% Фонд1 = 'Європейське майбутнє 2',
% Фонд2 = 'Європейське майбутнє' ;
% false.

% ?- ті_та_тільки_ті_сектори(Фонд1, 'Стабільність').
% false.

% ?- ті_та_тільки_ті_сектори('Європейське майбутнє', Фонд).
% Фонд = 'Європейське майбутнє 2' ;
% false.

% ?- ті_та_тільки_ті_сектори('Європейське майбутнє', 'Європейське майбутнє 2').
% true.

%_______________________________________________________________________________________
% ОПЕРАТОРИ





%допоміжні функції
intersect(X,[Y|Ys]):- member(Y,X)->!; intersect(X, Ys).

average(L1,Avg):-sum(L1,0,S),length(L1,0,L),Avg is S/L.

sum([H|T],A,S):-A1 is A+H,sum(T,A1,S).
sum([],A,A).

length([_|T],A,L):-A1 is A+1,length(T,A1,L).
length([],A,A).
