лектор(кл(10547), піб('Пітерсон', 'Джордан', 'Іванович'), дата_народження(22,2,1950),
 науковий_ступінь('к.ф.н'), кп(23), ставка(30), місце_основної_роботи('НаУКМА'), кк(22)).

лектор(кл(10549), піб('Голубовський', 'Сергій', 'Іванович'), дата_народження(10,9,1988),
 науковий_ступінь('к.ф.н'), кп(23), ставка(18), місце_основної_роботи('НаУКМА'), кк(22)).

лектор(кл(10548), піб('Артемовський', 'Віталій', 'Іванович'), дата_народження(5,5,1976),
 науковий_ступінь('к.ф.н'), кп(23), ставка(24), місце_основної_роботи('НаУКМА'), кк(22)).

розклад(кл(10547), кп(23), день('пн')).
розклад(кл(10547), кп(25), день('вт')).

розклад(кл(10549), кп(22), день('пн')).
розклад(кл(10549), кп(23), день('вт')).

розклад(кл(10548), кп(22), день('пн')).
розклад(кл(10548), кп(23), день('вт')).

розклад(кл(10549), кп(23), день('пн')).

предмет(кп(23242), назва('РБД'), години(108)).
посада(кп(23), назва('доцент')).
кафедра(кк(22), найменування('Інформатики'), кл(10547)).

%Скільки годин викладається певний предмет по з "пн" по "ср"?
% task1(КП, X) :- розклад(_, КП, 'пн')

%Визначити викладачів пенсійного віку (прізвище, науковий ступень, дата народження, організація; пенсійний вік >= 60років), які не викладають певну дисципліну.
task2(Прізвище, Науковий_ступінь, Дата_народження, Організація) :-
        лектор(_, Прізвище, Дата_народження, Науковий_ступінь, _, _, Організація, _),
        Дата_народження = дата_народження(_, _, Y), Y =< 1951. %просто фільтруємо


%Які викладачі (прізвище, ставка, посада) читають по тим самих дням (усім тим і тільки тим), що і певний викладач?
%те саме, що 4, але відкинути тих, хто викладає ще десь-інде
%task3(кл(10547), L, S, F, G). - приклад запиту
task3(КП, Codes, Прізвище, Ставка, Посада):- task4(КП, Codes, Прізвище, Ставка, Посада), not(badOnly(КП, Codes)).


%ті, що читають у непотрібний день
badOnly(КПет, L) :- not(розклад(КПет,_,Gr)), розклад(L,_,Gr).


%ті, які не читають в хоча би якийсь потрібний день
badLectors(КЛ, КПет) :- розклад(КПет, _, G),
                      not(розклад(КЛ, _, G)).


%Які викладачі (прізвище, кафедра) читають в усі ті дні (в усі ті та, можливо, і в інші), що і певний викладач?
task4(КП, Lectors, Прізвище, Ставка, Посада) :- лектор(Lectors,Прізвище,_,_,КПос,Ставка,_,_),
                                        посада(КПос, Посада), %дістаємо посаду
					not(badLectors(Lectors, КП)), %видалємо поганих
					КП \= Lectors. %вилучаємо вхідного
%пробні
task44(КЛ, Прізвище, Ставка, Посада):-
	%предмети які викладає
	розклад(КЛ,  _, Дні),
	%коди лекторів, які викладають на цих днях
	розклад(КЛ2, _, Дні),
        посада(КП, Посада),
	КЛ \= КЛ2,
    лектор(КЛ2, Прізвище, _, _, КП, Ставка, _, _).



task6(КЛ, Прізвище, Ставка, Посада,List) :- setof((Прізвище, Ставка, Посада), task4(КЛ,_, Прізвище, Ставка, Посада), List).
